app/controllers/favorites_controller.rb

INSERT INTO "favorites" ("tag", "name", "dribble", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["tag", ""], ["name", ""], ["dribble", "2764716"], ["user_id", 5], ["created_at", "2016-06-08 19:18:52.920608"], ["updated_at", "2016-06-08 19:18:52.920608"]]
---
  def create
    @favorite = current_user.favorites.build(favorite_params)

    if @favorite.save

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1  [["user_id", 5]]
---
    def set_favorite
      @favorite = current_user.favorites.find(params[:id])